In [1]:
import pandas as pd

In [62]:
df=pd.read_csv('../Iris.csv')

In [63]:
df

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [7]:
df.shape

(150, 6)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [13]:
pd.set_option('display.max_columns', 6)

In [18]:
pd.set_option('display.max_rows', 150)

In [2]:
data={
    'Tid':[1,2,3,4,5,6,7,8,9,10],
    'Refund':['Yes','No','No','Yes','No','No','Yes','No','No','No'],
    'Marital Status':['Single','Married','Single','Married','Divorced','Married','Divorced','Single','Married','Single'],
    'Taxable Income':['125K','100K','70K','120K','95K','60K','220K','85K','75K','90K'],
    'Cheat':['No','No','No','No','Yes','No','No','Yes','No','Yes'],
}

In [3]:
ddf=pd.DataFrame(data)

In [4]:
ddf

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No
9   10     No         Single            90K   Yes

In [11]:
type(ddf['Refund'])

pandas.core.series.Series

In [10]:
type(ddf.Refund)

pandas.core.series.Series

In [19]:
ddf[['Refund','Cheat']]

  Refund Cheat
0    Yes    No
1     No    No
2     No    No
3    Yes    No
4     No   Yes
5     No    No
6    Yes    No
7     No   Yes
8     No    No
9     No   Yes

In [22]:
ddf.columns

Index(['Tid', 'Refund', 'Marital Status', 'Taxable Income', 'Cheat'], dtype='object')

In [43]:
ddf.iloc[1:5,0:3]

   Tid Refund Marital Status
1    2     No        Married
2    3     No         Single
3    4    Yes        Married
4    5     No       Divorced

In [48]:
ddf.iloc[[1,5,9],0:3]

   Tid Refund Marital Status
1    2     No        Married
5    6     No        Married
9   10     No         Single

In [54]:
ddf.loc[[1,5]]

   Tid Refund Marital Status Taxable Income Cheat
1    2     No        Married           100K    No
5    6     No        Married            60K    No

In [56]:
ddf.loc[1:5]

   Tid Refund Marital Status Taxable Income Cheat
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No

In [64]:
df['PetalWidthCm'].value_counts()

PetalWidthCm
0.2    28
1.3    13
1.5    12
1.8    12
1.4     8
2.3     8
0.4     7
1.0     7
0.3     7
0.1     6
2.1     6
2.0     6
1.2     5
1.9     5
1.6     4
2.5     3
2.2     3
1.1     3
2.4     3
1.7     2
0.6     1
0.5     1
Name: count, dtype: int64

In [9]:
d=ddf.set_index('Tid')
d

    Refund Marital Status Taxable Income Cheat
Tid
1      Yes         Single           125K    No
2       No        Married           100K    No
3       No         Single            70K    No
4      Yes        Married           120K    No
5       No       Divorced            95K   Yes
6       No        Married            60K    No
7      Yes       Divorced           220K    No
8       No         Single            85K   Yes
9       No        Married            75K    No
10      No         Single            90K   Yes

In [10]:
d.loc[1,'Cheat']

'No'